Documents/гф_УстановкаСнятиеЛимита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гф_УстановкаСнятиеЛимита</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гф_ВидыОперацийЛимита</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_СтатусыЛимитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЛимита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_ВидыЛимитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/гф_ВидыОперацийЛимита.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>гф_ВидыОперацийЛимита</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СнятиеЛимита</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаЛимита</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/гф_УстановкаСнятиеЛимита/Forms/гф_ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 
// #wortmann {
// Условное оформление для формы
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
   	УстановитьУсловноеОформление();
 	
КонецПроцедуры
// } #wortmann

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы 
// #wortmann {
// Условное оформление для формы
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
 УстановитьУсловноеОформление();
КонецПроцедуры
// } #wortmann 

// #wortmann {
// В зависимости от вида операции,указание опреденных статусов документа.
// #4.1.15
// Галфинд(Просто) Боцманова 2022/09/01
&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	СтандартнаяОбработка=Ложь; 
	
	Если Объект.ВидОперации=ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.гф_ВидыОперацийЛимита.УстановкаЛимита") Тогда
		
		Массив=Новый Массив;
		Массив.Добавить(Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Действующий")));
		Массив.Добавить(Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Запрошен")));
		Массив.Добавить(Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Утвержден")));
		
		Отбор=Новый	Структура;
		Отбор.Вставить("Наименование",Массив);  
	Иначе
		Отбор=Новый	Структура;
		Отбор.Вставить("Наименование",Строка(ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Приостановлен")));  	
	КонецЕсли;  
	П=Новый Структура("Отбор",Отбор);
	ОткрытьФорму("Справочник.гф_СтатусыЛимитов.ФормаВыбора",П); 
	
КонецПроцедуры
// } #wortmann

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область УсловноеОформление
// #wortmann {
// Если вид операции "снятие лимита",сумма недоступна для редактирования   и установка статус для данного вида операции
// #4.1.15
// Галфинд(Просто) Боцманова 2022/08/30
&НаСервере
Процедура УстановитьУсловноеОформление()   
	
	Если Объект.ВидОперации=Перечисления.гф_ВидыОперацийЛимита.СнятиеЛимита Тогда 
	    Элементы.Сумма.Доступность=Ложь;
		Объект.Сумма=0;
		Объект.Статус=ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.гф_СтатусыЛимитов.Приостановлен");  
	КонецЕсли;  

КонецПроцедуры
// } #wortmann
#КонецОбласти
#КонецОбласти
